In [ ]:
"""
SQL databases: MySQL, PostgreSQL, SqLite, Microsoft SQL Server, and Oracle Database are most popular databases.
-- This notebook is showing how to connect python to database MySQL and SQLite
-- Access DataBase through Magic SQL (connect to MySql and SqLite), run query and make DataFrame  
"""

# Connect to MySQL using python

In [26]:
#!pip install mysql-connector-python
#!pip install pymysql
import mysql.connector
import pymysql
from sqlalchemy import create_engine
import pandas as pd

In [28]:
connection=mysql.connector.connect(
    host='127.0.0.1',
    user='root',
    password='ms880421SM!@#',
    database='moviesdb',
    ssl_disabled=True    
)
cursor=connection.cursor()

In [29]:
query='''
SELECT title, industry FROM movies;
'''

cursor.execute(query)
result=[]
for i, data in enumerate(cursor):
    result.append(data)

cursor.close()
connection.close()

In [30]:
df=pd.DataFrame(result, columns=['title','industry'])
df.head()

                                         title   industry
0                             K.G.F: Chapter 2  Bollywood
1  Doctor Strange in the Multiverse of Madness  Hollywood
2                        Thor: The Dark World   Hollywood
3                              Thor: Ragnarok   Hollywood
4                      Thor: Love and Thunder   Hollywood

In [32]:
# engine = create_engine(f'mysql+pymysql://{username}:{password}@{host}/{database}')
engine = create_engine(f"mysql+pymysql://root:ms880421SM%21%40%23@127.0.0.1/moviesdb")
df=pd.read_sql(query,engine)
df.head()

                                         title   industry
0                             K.G.F: Chapter 2  Bollywood
1  Doctor Strange in the Multiverse of Madness  Hollywood
2                        Thor: The Dark World   Hollywood
3                              Thor: Ragnarok   Hollywood
4                      Thor: Love and Thunder   Hollywood

In [5]:
df_new=df['title']
df_new.to_sql("moviesdb_title", engine, if_exists='replace', index=False)

39

In [7]:
df1=pd.read_sql("SELECT * FROM movies",engine)
df1.to_sql("db_test", engine, if_exists='replace', index=False)  

df2=df1.copy()

df2['movie_id']=df1['movie_id']+100
df2.to_sql("db_test", engine, if_exists='append', index=False) 

df_new=pd.read_sql("db_test",engine)
df_new

,movie_id,title,industry,release_year,imdb_rating,studio,language_id
0,101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3
1,102,Doctor Strange in the Multiverse of Madness,Hollywood,2022,7.0,Marvel Studios,5
2,103,Thor: The Dark World,Hollywood,2013,6.8,Marvel Studios,5
3,104,Thor: Ragnarok,Hollywood,2017,7.9,Marvel Studios,5
4,105,Thor: Love and Thunder,Hollywood,2022,6.8,Marvel Studios,5
...,...,...,...,...,...,...,...
73,236,Bajrangi Bhaijaan,Bollywood,2015,8.1,Salman Khan Films,1
74,237,Captain America: The First Avenger,Hollywood,2011,6.9,Marvel Studios,5
75,238,Captain America: The Winter Soldier,Hollywood,2014,7.8,Marvel Studios,5
76,239,Race 3,Bollywood,2018,1.9,Salman Khan Films,1
77,240,Shershaah,Bollywood,2021,8.4,Dharma Productions,1

# SQL Magic (%) to connect to Mysql and make DataFrame

In [36]:
%load_ext sql
%sql mysql+pymysql://root:ms880421SM%21%40%23@127.0.0.1/moviesdb
actor_table=%sql SELECT * FROM actors
actor_table_df=actor_table.DataFrame()
actor_table_df

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * mysql+pymysql://root:***@127.0.0.1/moviesdb
   sqlite:///"mydb_train.db"
67 rows affected.

    actor_id                  name  birth_year
0         50                  Yash        1986
1         51           Sanjay Dutt        1959
2         52  Benedict Cumberbatch        1976
3         53       Elizabeth Olsen        1989
4         54       Chris Hemsworth        1983
..       ...                   ...         ...
62       166       Tommy Lee Jones        1946
63       167        Sebastian Stan        1982
64       168           Anil Kapoor        1956
65       169     Sidharth Malhotra        1985
66       170          Kiara Advani        1991

[67 rows x 3 columns]

# Connect to SQLite Database using Python

In [2]:
#pip install sqlite  (brew install sqlite)
#sqlite3 --version
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('mydb_train.db')
cursor_obj = conn.cursor()
cursor_obj.execute("DROP TABLE IF EXISTS mydb_train")

In [3]:
table = """ 
create table IF NOT EXISTS mydb_train(
ID INTEGER PRIMARY KEY NOT NULL,
FNAME VARCHAR(20),
LNAME VARCHAR(20),
CITY VARCHAR(20),
CCODE CHAR(2));
"""
 
cursor_obj.execute(table)

In [4]:
insert='''
insert into mydb_train values
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA'),
(2, 'Raul', 'Chong', 'Markham', 'CA'),
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')
'''
cursor_obj.execute(insert)

In [5]:
query = '''SELECT * FROM mydb_train'''
cursor_obj.execute(query)

output_all = cursor_obj.fetchall()   #.fetchmany(2)
for row_all in output_all:
  print(row_all)

(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [6]:
query="select * from mydb_train where CCODE='CA' "
df = pd.read_sql_query(query, conn)
df.head()

   ID FNAME  LNAME     CITY CCODE
0   1   Rav  Ahuja  TORONTO    CA
1   2  Raul  Chong  Markham    CA

In [7]:
conn.close()

# Use SQL Magic (% for line execution and %% for the whole cell)

In [3]:
#pip install --user ipython-sql
conn = sqlite3.connect('mydb_train.db')
%load_ext sql
%sql sqlite:///"mydb_train.db"

In [4]:
%%sql  
create table IF NOT EXISTS mydb_train(
ID INTEGER PRIMARY KEY NOT NULL,
FNAME VARCHAR(20),
LNAME VARCHAR(20),
CITY VARCHAR(20),
CCODE CHAR(2));

insert into mydb_train values
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA'),
(2, 'Raul', 'Chong', 'Markham', 'CA'),
(3, 'Hima', 'Vasudevan', 'Chicago', 'US');

 * sqlite:///"mydb_train.db"
Done.
3 rows affected.

[]

In [20]:
%sql select * from mydb_train where CCODE="CA"

 * sqlite:///"mydb_train.db"
Done.

[(1, 'Rav', 'Ahuja', 'TORONTO', 'CA'), (2, 'Raul', 'Chong', 'Markham', 'CA')]

In [25]:
city_code='US'
us_citizen=%sql select * from mydb_train where CCODE=:city_code
us_citizen_db=us_citizen.DataFrame()
us_citizen_db

 * sqlite:///"mydb_train.db"
Done.

   ID FNAME      LNAME     CITY CCODE
0   3  Hima  Vasudevan  Chicago    US